CDiamondGit/stm32SpaceInvaders/src/main.c
/*
 * renderAliens – full grid redraw.
 * Used at startup, level reset, and after every move tick.
 *
 * On a move tick the dirty-strip strategy is used:
 *   1. Erase the vacated edge strip (one fillRectangle call).
 *   2. Blit only alive aliens – dead cells stay black automatically
 *      because the strip erase already cleared them.
 */

static void renderAliens(void) {
  AlienGrid* ag = &gs.aliens;

  /* Nothing changed this frame – skip entirely */
  if (ag->offsetX == ag->oldOffsetX && ag->offsetY == ag->oldOffsetY)
    return;

  /* 1. Erase the full bounding box at the OLD position */
  fillRectangle((uint16_t)ag->oldOffsetX, (uint16_t)ag->oldOffsetY,
                ALIEN_GRID_W, ALIEN_GRID_H, 0);

  /* 2. Blit alive aliens at the NEW position */
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue;

      if (i == 0) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 redAlien[ag->earToggle], 1, 0);
      }
      if (i == 1) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 greenAlien[ag->earToggle], 1, 0);
      }
      if (i >= 2) {
        putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
                 (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
                 blueAlienBoth[ag->earToggle], 1, 0);
      }
    }
  }

  /* 3. Sync so next frame knows nothing changed unless moveAliens runs */
  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;
}
/* Dirty-rect ship: erase only the vacated edge strip */
static void renderShip(void) {
  if (gs.ship.coords.oldX == gs.ship.coords.x &&
      gs.ship.coords.oldY == gs.ship.coords.y)
    return;

  int16_t dx = (int16_t)gs.ship.coords.x - gs.ship.coords.oldX;

  if (dx > 0)
    fillRectangle(gs.ship.coords.oldX, gs.ship.coords.oldY, (uint16_t)dx,
                  SHIP_H, 0);
  else if (dx < 0)
    fillRectangle(gs.ship.coords.x + SHIP_W, gs.ship.coords.oldY,
                  (uint16_t)(-dx), SHIP_H, 0);

  gs.ship.coords.oldX = gs.ship.coords.x;
  gs.ship.coords.oldY = gs.ship.coords.y;
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
}

/* Erase tail strip only, draw new bullet head */
static void renderPlayerBullet(void) {
  if (gs.bullet.state != BULLET_FIRE)
    return;

  Bullet* b = &gs.bullet;
  fillRectangle(b->coords.oldX, b->coords.oldY + BULLET_H, BULLET_W, b->speed,
                0);
  b->coords.oldX = b->coords.x;
  b->coords.oldY = b->coords.y;
  fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H, BULLET_COLOR);
}

static void renderAlienBullets(void) {
  AlienGrid* ag = &gs.aliens;
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;

    /* 1. Erase old position */
    fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H, 0);

    /* 2. Repair aliens whose pixels the erase may have destroyed */
    repairAliensUnderRect(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H);

    /* 3. Draw bullet at new position */
    b->coords.oldX = b->coords.x;
    b->coords.oldY = b->coords.y;
    fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H,
                  ALIEN_BULLET_COLOR);
  }
}

static void renderBarricade() {
  fillRectangle(20, 115, 20, 10, 51975);
}

/* Top-level render dispatcher */
static void renderScene(void) {
  renderBarricade();
  renderAliens(); /* no-op internally if grid didn't move this frame */
  renderShip();
  renderPlayerBullet();
  renderAlienBullets();
}

static void resetGame(void) {
  /* Blank the whole play area above the HUD line */
  fillRectangle(0, 0, SCREEN_W, HUD_LINE_Y, 0);

  /* Re-initialise all game state */
  initGameState();

  /* Redraw the initial scene */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  gs.lives -= 1;
  /* HUD line stays – was never erased */
}

/*
 * 10. MAIN
 *
 */
int main(void) {
  /* Hardware */
  initClock();
  initSysTick();
  setupIO();
  initSound();
  initSerial();

  /* Game */
  initGameState();

  /* Initial draw */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  drawLine(0, HUD_LINE_Y, SCREEN_W, HUD_LINE_Y, HUD_LINE_COLOR);

  /* Game loop */
  while (1) {
    // twinkle_twinkle();

    uint32_t now = milliseconds;
    if (now - lastUpdate < FRAME_DELAY)
      continue;
    lastUpdate = now;

    if (gs.lives == 0)
      return;

    /* Advance bullet */
    if (gs.bullet.state == BULLET_FIRE) {
      gs.bullet.coords.y -= gs.bullet.speed;
      if (gs.bullet.coords.y < 5) {
        resetPlayerBullet();
        // renderPlayerBullet();
      }
    } else {
      gs.bullet.coords.x = gs.ship.coords.x + BULLET_OFFSET_X;
      gs.bullet.coords.y = gs.ship.coords.y - BULLET_OFFSET_Y;
    }

    AlienGrid* ag = &gs.aliens;

    for (int j = 0; j < ALIEN_COLS; j++) {
      Bullet* b = &ag->ab[j];
      if (b->state == BULLET_FIRE) {
        b->coords.y += b->speed; /* alien bullets go DOWN */
        if (b->coords.y > HUD_LINE_Y - 5)
          resetAlienBullet(j);
      }
      /* READY bullets track the grid in moveAliens/parkAlienBullet */
    }

    handleInput();   /* buttons-> positions*/
    moveAliens(now); /* now = time, timer-> alien grid shift */
    // updateAlienFire(now);
    updatePlayerCollision(); /* bullet    -> alien grid       */
    /*
    TODO :
    implement alien bullet. | redrawing every alien that has overlapped with
    bullet
    */

    if (updateAlienBulletCollision()) {
      resetGame();
      continue;
    }

    if (checkGameOver()) {
      resetGame();
      continue;
    }
    renderScene(); /* positions -> screen           */
  }

  return 0;
}